blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
#+TITLE: Eat my huge Files: Tail Recursion in OCaml
#+DATE: <2022-02-25 Fri>
#+SUBTITLE: Project »CSV Cleaner« – 3rd Episode
#+LANGUAGE: en
#+DESCRIPTION: Coding project for beginners: "CSV Cleaner": Tail recursion in OCaml – working with big lists
#+KEYWORDS: tail recursion, tail call, recursive, ocaml, tutorial, project idea, learn ocaml, csv, pattern matching
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">
#+SETUPFILE: ../static/setup.org
#+OPTIONS:

#+ATTR_HTML: :class pager
#+begin_nav
This post is part of a miniseries:
1. [[file:learning-to-code-first-app-episode-1.tutorial.org][Manipulation CSV Files in Common Lisp]]
2. [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org][Rewrite in OCaml -- Tooling, Association Lists and Pattern Matching]]
3. *[[file:first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org][Eat my Huge Files: Tail Recursion in OCaml]]*
#+end_nav

#+TOC: headlines 2

* What is this about?

This is the 3rd episode of a blog series where we walk through my very first coding project: a small command line utility to manipulate CSV files. I found it too tedious messing with spreadsheets, so I went on to automate it.

I'm a beginner on a journey to learn programming, so this is no authoritative guide how these things should be done. It's just that I learn stuff most throughly when I explain it to … you. Welcome!

The project started in Common Lisp, and during the previous episode it got rewritten in OCaml. This episode builds on top of the former, so you might want to [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org][peek at the previous episode]] in order to pick up the details.

** This Code Walktrough is for you, if …

- you want to become a hacker (obviously)
- you struggle with recursive functions
- you want to learn how to write tail recursive functions
- you are just curious about functional programming

If you want to follow the walktrough: For the most part you can just use [[https://try.ocaml.pro/][TryOCaml]], and there is a [[https://ocaml-learn-code.com/][free App for iOS]] and [[https://play.google.com/store/apps/details?id=fr.vernoux.ocaml&hl=en_US&gl=US][Android]], too. But if you want to do all the stuff here (like compiling a binary), you'll need a working [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org::*OCaml Installation and Project Setup][OCaml setup]] and an editor of your choice (my recommendation: invest some playtime into [[https://github.com/monkeyjunglejuice/emacs.onboard][Emacs]])

** What can this Program do?

Those features got implemented in the [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org][previous episode]]:

- [X] Open and read a CSV file "input.csv"
- [X] Remove some columns according to a "template.csv"
- [ ] Perform search and replace on cell content
- [X] Set the pipe '|' as the delimiter char
- [X] Spit out a sweet cleaned CSV file "output.csv"
- [X] Compile to a standalone binary

* Ready for the funky Stuff?

I'm super curious how the CSV Cleaner performs. Let's throw some really fat monster CSVs on it, with thousands … yeah, and millions of rows!

** My Benchmark Setup

1. Compile the [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org::*Version 0.2][CSV Cleaner v0.2]] from the previous episode
2. Download some [[https://eforexcel.com/wp/downloads-18-sample-csv-files-data-sets-for-testing-sales/][sample data sets from "EforExcel"]]
3. Make a file =template.csv= stating which columns to keep in the cleaned CSV (dropping 7 of 14 columns)
4. Create a separate directory for each CSV with its own CSV Cleaner binary
5. Run CSV Cleaner on all CSVs and measure the time it takes to proceed the =output.csv= (10 runs per CSV; fastest run wins)

** Let the Madness begin!

|    Rows | Columns | Size MiB | User sec | System sec | Elapsed sec |
|---------+---------+----------+----------+------------+-------------|
|  100000 |      14 |     11.9 |     0.59 |       0.05 |        0.65 |
|  200000 |      14 |     23.4 |     1.27 |       0.12 |        1.41 |
|  300000 |      14 |     35.1 |     2.01 |       0.11 |        2.13 |
|  500000 |      14 |     59.5 |          |            |             |
| 1000000 |      14 |    119.0 |          |            |             |
| 5000000 |      14 |    595.1 |          |            |             |

*** Aaaaaand Crash!

=Fatal error: exception Stack_overflow= somewhere on the way up to 500000 rows!

