blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-10-20 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Eat my huge Files: Tail Recursion in OCaml</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Coding project for beginners: &quot;CSV Cleaner&quot;: Tail recursion in OCaml – working with big lists" />
<meta name="keywords" content="tail recursion, tail call, recursive, ocaml, tutorial, project idea, learn ocaml, csv, pattern matching" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-etoile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-aile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="about" href="/about.html">About</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2024-10-20">Last updated: 2024-10-20</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Eat my huge Files: Tail Recursion in OCaml</h1>
<p class="subtitle" role="doc-subtitle">Project »CSV Cleaner« – 3rd Episode</p>
</header><nav class="pager" id="orgdae3fea">
<p>
This post is part of a miniseries:<br>
</p>
<ol class="org-ol">
<li><a href="learning-to-code-first-app-episode-1.tutorial.html">Manipulation CSV Files in Common Lisp</a><br></li>
<li><a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html">Rewrite in OCaml &#x2013; Tooling, Association Lists and Pattern Matching</a><br></li>
<li><b><a href="first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">Eat my Huge Files: Tail Recursion in OCaml</a></b><br></li>
</ol>
</nav>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org29bf323">What is this about?</a>
<ul>
<li><a href="#org04eea63">This Code Walktrough is for you, if …</a></li>
<li><a href="#orgdfd4e0d">What can this Program do?</a></li>
</ul>
</li>
<li><a href="#org7ddbf9f">Ready for the funky Stuff?</a>
<ul>
<li><a href="#orged53414">My Benchmark Setup</a></li>
<li><a href="#org1ee99be">Let the Madness begin!</a></li>
<li><a href="#org58ed100">Why did this happen?</a></li>
</ul>
</li>
<li><a href="#org065a34b">How can we use Recursive Functions safely?</a>
<ul>
<li><a href="#orgea1bc99">How to tell if a Function is (not) tail-recursive</a></li>
<li><a href="#org283c178">Recipe for tail-recursive Functions</a></li>
</ul>
</li>
<li><a href="#org5135167">Digesting really big CSV Files</a>
<ul>
<li><a href="#org97ec155">Fixing the »Clean« Function</a></li>
<li><a href="#org02949ca">Fixing the »Dissoc« Function</a></li>
</ul>
</li>
<li><a href="#org83a6aa3">Oh how unsatisfying that was!</a>
<ul>
<li><a href="#org46693fb">Bullet-proof »Clean« Function</a></li>
<li><a href="#orgc118c31">Bullet-proof »Dissoc« Function</a></li>
</ul>
</li>
<li><a href="#orgf84d0b8">Final Comparison</a></li>
<li><a href="#orgdb73047">Conclusion</a></li>
<li><a href="#orgbe706f5">Full Code Listing, Version 0.3</a></li>
<li><a href="#orgd8ab0e4">What&rsquo;s next?</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org29bf323" class="outline-2">
<h2 id="org29bf323"><a href="#org29bf323">What is this about?</a></h2>
<div class="outline-text-2" id="text-org29bf323">
<p>
This is the 3rd episode of a blog series where we walk through my very first coding project: a small command line utility to manipulate CSV files. I found it too tedious messing with spreadsheets, so I went on to automate it.<br>
</p>

<p>
I&rsquo;m a beginner on a journey to learn programming, so this is no authoritative guide how these things should be done. It&rsquo;s just that I learn stuff most throughly when I explain it to … you. Welcome!<br>
</p>

<p>
The project started in Common Lisp, and during the previous episode it got rewritten in OCaml. This episode builds on top of the former, so you might want to <a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html">peek at the previous episode</a> in order to pick up the details.<br>
</p>
</div>
<div id="outline-container-org04eea63" class="outline-3">
<h3 id="org04eea63"><a href="#org04eea63">This Code Walktrough is for you, if …</a></h3>
<div class="outline-text-3" id="text-org04eea63">
<ul class="org-ul">
<li>you want to become a hacker (obviously)<br></li>
<li>you struggle with recursive functions<br></li>
<li>you want to learn how to write tail recursive functions<br></li>
<li>you are just curious about functional programming<br></li>
</ul>

<p>
If you want to follow the walktrough: For the most part you can just use <a href="https://try.ocaml.pro/">TryOCaml</a>, and there is a <a href="https://ocaml-learn-code.com/">free App for iOS</a> and <a href="https://play.google.com/store/apps/details?id=fr.vernoux.ocaml&amp;hl=en_US&amp;gl=US">Android</a>, too. But if you want to do all the stuff here (like compiling a binary), you&rsquo;ll need a working <a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html#orgd6a26d1">OCaml setup</a> and an editor of your choice (my recommendation: invest some playtime into <a href="https://github.com/monkeyjunglejuice/emacs.onboard">Emacs</a>)<br>
</p>
</div>
</div>
<div id="outline-container-orgdfd4e0d" class="outline-3">
<h3 id="orgdfd4e0d"><a href="#orgdfd4e0d">What can this Program do?</a></h3>
<div class="outline-text-3" id="text-orgdfd4e0d">
<p>
Those features got implemented in the <a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html">previous episode</a>:<br>
</p>

<ul class="org-ul">
<li class="on">&#x2611; Open and read a CSV file &ldquo;input.csv&rdquo;<br></li>
<li class="on">&#x2611; Remove some columns according to a &ldquo;template.csv&rdquo;<br></li>
<li class="off">&#x2610; Perform search and replace on cell content<br></li>
<li class="on">&#x2611; Set the pipe &rsquo;|&rsquo; as the delimiter char<br></li>
<li class="on">&#x2611; Spit out a sweet cleaned CSV file &ldquo;output.csv&rdquo;<br></li>
<li class="on">&#x2611; Compile to a standalone binary<br></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7ddbf9f" class="outline-2">
<h2 id="org7ddbf9f"><a href="#org7ddbf9f">Ready for the funky Stuff?</a></h2>
<div class="outline-text-2" id="text-org7ddbf9f">
<p>
I&rsquo;m super curious how the CSV Cleaner performs. Let&rsquo;s throw some really fat monster CSVs on it, with thousands … yeah, and millions of rows!<br>
</p>
</div>
<div id="outline-container-orged53414" class="outline-3">
<h3 id="orged53414"><a href="#orged53414">My Benchmark Setup</a></h3>
<div class="outline-text-3" id="text-orged53414">
<ol class="org-ol">
<li>Compile the <a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html#org5f85c55">CSV Cleaner v0.2</a> from the previous episode<br></li>
<li>Download some <a href="https://eforexcel.com/wp/downloads-18-sample-csv-files-data-sets-for-testing-sales/">sample data sets from &ldquo;EforExcel&rdquo;</a><br></li>
<li>Make a file <code>template.csv</code> stating which columns to keep in the cleaned CSV (dropping 7 of 14 columns)<br></li>
<li>Create a separate directory for each CSV with its own CSV Cleaner binary<br></li>
<li>Run CSV Cleaner on all CSVs and measure the time it takes to proceed the <code>output.csv</code> (10 runs per CSV; fastest run wins)<br></li>
</ol>
</div>
</div>
<div id="outline-container-org1ee99be" class="outline-3">
<h3 id="org1ee99be"><a href="#org1ee99be">Let the Madness begin!</a></h3>
<div class="outline-text-3" id="text-org1ee99be">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Rows</th>
<th scope="col" class="org-right">Columns</th>
<th scope="col" class="org-right">Size MiB</th>
<th scope="col" class="org-right">User sec</th>
<th scope="col" class="org-right">System sec</th>
<th scope="col" class="org-right">Elapsed sec</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">100000</td>
<td class="org-right">14</td>
<td class="org-right">11.9</td>
<td class="org-right">0.59</td>
<td class="org-right">0.05</td>
<td class="org-right">0.65</td>
</tr>

<tr>
<td class="org-right">200000</td>
<td class="org-right">14</td>
<td class="org-right">23.4</td>
<td class="org-right">1.27</td>
<td class="org-right">0.12</td>
<td class="org-right">1.41</td>
</tr>

<tr>
<td class="org-right">300000</td>
<td class="org-right">14</td>
<td class="org-right">35.1</td>
<td class="org-right">2.01</td>
<td class="org-right">0.11</td>
<td class="org-right">2.13</td>
</tr>

<tr>
<td class="org-right">500000</td>
<td class="org-right">14</td>
<td class="org-right">59.5</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1000000</td>
<td class="org-right">14</td>
<td class="org-right">119.0</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5000000</td>
<td class="org-right">14</td>
<td class="org-right">595.1</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org8e35777" class="outline-4">
<h4 id="org8e35777"><a href="#org8e35777">Aaaaaand Crash!</a></h4>
<div class="outline-text-4" id="text-org8e35777">
<p>
<code>Fatal error: exception Stack_overflow</code> somewhere on the way up to 500000 rows!<br>
</p>
</div>
</div>
</div>
