blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
** Why did this happen?

The [[https://en.wikipedia.org/wiki/Call_stack][call stack]] or simply "the stack" is an area in memory that keeps track of the information associated with a function call. It can overflow because the stack is limited per thread of execution by the operating system, which leads to a certain "stack depth", and therefore a maximum of function calls it can handle.

In the CSV Cleaner program, we're making use of /recursive functions/ – who call themselves in their own definition to iterate over /lists/ (those are the data structures I've implemented the rows of the CSV file in). Here is a simple example of such a recursive function that sums a list of numbers:

#+caption: Recursive function
#+begin_src ocaml
  let rec sum l =                  (* function definition *)
    match l with
    | [] -> 0                      (* 1 *)
    | hd :: tl -> hd + (sum tl);;  (* 2 *)

  sum [1; 2; 3; 4; 5];;            (* function call with a list as the argument*)
#+end_src

*** How does this Function work?

1. "If the list is empty, return 0 and stop."
2. "Alternatively … take the first element of the list and … take the first element of the rest and … take the first element of the new rest … and so on and on, until the list is empty … then add everything up and return the value."

Here is how the ~sum~ function is applied to the list of 5 elements, producing 6 nested function calls (in the test before, we fed a list with 500000 elements to such a function). For each nested function call a new /stack frame/ is created on the stack:

#+begin_example
sum <-- [1; 2; 3; 4; 5]
sum <-- [2; 3; 4; 5]
sum <-- [3; 4; 5]
sum <-- [4; 5]
sum <-- [5]
sum <-- []
sum --> 0
sum --> 5
sum --> 9
sum --> 12
sum --> 14
sum --> 15
- : int = 15
#+end_example

*** The Consequence

If there are just enough nested function calls piling up, at some point the stack will be exhausted and we're getting a "stack overflow" (what actually piles up are the stack frames; those are data structures containing information about the function calls).

* How can we use Recursive Functions safely?

The OCaml compiler knows a technique which is called "[[https://eklitzke.org/how-tail-call-optimization-works][Tail call optimization]]" (TCO). It has first and foremost nothing to do with recursion – but utilizing this technique, the compiler can produce instructions to re-use use the caller's stack frame for the recursive calls, instead of creating a new stack frame on top of another for each nested function call.

There is one thing though: The recursive function has to be written in a certain way so that the compiler is able to optimize it: The function call to itself must be the very last thing that happens within one recursive cycle. Ok, but what does that mean?

** How to tell if a Function is (not) tail-recursive

1. Option: Recognize it yourself.
   Basically, you only need to know what will be evaluated before what.
2. Option: Check with the built-in "ocaml.tailcall" attribute.
   ~[@tailcall]~ can be applied in the recursive call (see below) in order to check if the call is a tail call. If it is no tail call, a warning is emitted.

*** ✘ Not tail-recursive
Look at the recursive case (second branch). There's not only the call of the function ~sum tl~ itself, but another thing is happening too: the addition ~hd +~ … added to /what/? Yes, exactly … to the value of ~sum tl~ which has to be computed /before/ the addition can happen. Ergo the recursive call is not the last thing, and therefore this is no "tail call".

#+begin_src ocaml
  let rec sum l =   (* function definition *)
    match l with
    | [] -> 0
    | hd :: tl -> hd + sum tl;;   (* <-- recursive case *)

  sum [1; 2; 3; 4; 5];;   (* applying the function to a list of numbers *)
#+end_src

#+caption: Check for tail call
#+begin_src ocaml
let rec sum l =
    match l with
    | [] -> 0
    | hd :: tl -> hd + (sum [@tailcall]) tl;;
#+end_src
Check failed – warning:
#+begin_example
  Line 4, characters 23-42:
  4 |     | hd :: tl -> hd + (sum [@tailcall]) tl;;
                             ^^^^^^^^^^^^^^^^^^^^
  Warning 51 [wrong-tailcall-expectation]: expected tailcall
  val sum : int list -> int = <fun>
#+end_example

