blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-org58ed100" class="outline-3">
<h3 id="org58ed100"><a href="#org58ed100">Why did this happen?</a></h3>
<div class="outline-text-3" id="text-org58ed100">
<p>
The <a href="https://en.wikipedia.org/wiki/Call_stack">call stack</a> or simply &ldquo;the stack&rdquo; is an area in memory that keeps track of the information associated with a function call. It can overflow because the stack is limited per thread of execution by the operating system, which leads to a certain &ldquo;stack depth&rdquo;, and therefore a maximum of function calls it can handle.<br>
</p>

<p>
In the CSV Cleaner program, we&rsquo;re making use of <i>recursive functions</i> – who call themselves in their own definition to iterate over <i>lists</i> (those are the data structures I&rsquo;ve implemented the rows of the CSV file in). Here is a simple example of such a recursive function that sums a list of numbers:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Recursive function</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">sum</span> <span class="org-variable-name">l</span> =                  <span class="org-comment-delimiter">(* </span><span class="org-comment">function definition</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; 0                      <span class="org-comment-delimiter">(* </span><span class="org-comment">1</span><span class="org-comment-delimiter"> *)</span>
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; hd + <span class="org-rainbow-delimiters-depth-1">(</span>sum tl<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-tuareg-font-double-semicolon">;;</span>  <span class="org-comment-delimiter">(* </span><span class="org-comment">2</span><span class="org-comment-delimiter"> *)</span>

sum <span class="org-rainbow-delimiters-depth-1">[</span>1; 2; 3; 4; 5<span class="org-rainbow-delimiters-depth-1">]</span><span class="org-tuareg-font-double-semicolon">;;</span>            <span class="org-comment-delimiter">(* </span><span class="org-comment">function call with a list as the argument</span><span class="org-comment-delimiter">*)</span>
</pre>
</div>
</div>
<div id="outline-container-org55a9bff" class="outline-4">
<h4 id="org55a9bff"><a href="#org55a9bff">How does this Function work?</a></h4>
<div class="outline-text-4" id="text-org55a9bff">
<ol class="org-ol">
<li>&ldquo;If the list is empty, return 0 and stop.&rdquo;<br></li>
<li>&ldquo;Alternatively … take the first element of the list and … take the first element of the rest and … take the first element of the new rest … and so on and on, until the list is empty … then add everything up and return the value.&rdquo;<br></li>
</ol>

<p>
Here is how the <code>sum</code> function is applied to the list of 5 elements, producing 6 nested function calls (in the test before, we fed a list with 500000 elements to such a function). For each nested function call a new <i>stack frame</i> is created on the stack:<br>
</p>

<pre class="example" id="org96a3ec1">
sum &lt;-- [1; 2; 3; 4; 5]
sum &lt;-- [2; 3; 4; 5]
sum &lt;-- [3; 4; 5]
sum &lt;-- [4; 5]
sum &lt;-- [5]
sum &lt;-- []
sum --&gt; 0
sum --&gt; 5
sum --&gt; 9
sum --&gt; 12
sum --&gt; 14
sum --&gt; 15
- : int = 15
</pre>
</div>
</div>
<div id="outline-container-org5135ea8" class="outline-4">
<h4 id="org5135ea8"><a href="#org5135ea8">The Consequence</a></h4>
<div class="outline-text-4" id="text-org5135ea8">
<p>
If there are just enough nested function calls piling up, at some point the stack will be exhausted and we&rsquo;re getting a &ldquo;stack overflow&rdquo; (what actually piles up are the stack frames; those are data structures containing information about the function calls).<br>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org065a34b" class="outline-2">
<h2 id="org065a34b"><a href="#org065a34b">How can we use Recursive Functions safely?</a></h2>
<div class="outline-text-2" id="text-org065a34b">
<p>
The OCaml compiler knows a technique which is called &ldquo;<a href="https://eklitzke.org/how-tail-call-optimization-works">Tail call optimization</a>&rdquo; (TCO). It has first and foremost nothing to do with recursion – but utilizing this technique, the compiler can produce instructions to re-use use the caller&rsquo;s stack frame for the recursive calls, instead of creating a new stack frame on top of another for each nested function call.<br>
</p>

<p>
There is one thing though: The recursive function has to be written in a certain way so that the compiler is able to optimize it: The function call to itself must be the very last thing that happens within one recursive cycle. Ok, but what does that mean?<br>
</p>
</div>
<div id="outline-container-orgea1bc99" class="outline-3">
<h3 id="orgea1bc99"><a href="#orgea1bc99">How to tell if a Function is (not) tail-recursive</a></h3>
<div class="outline-text-3" id="text-orgea1bc99">
<ol class="org-ol">
<li>Option: Recognize it yourself.<br>
Basically, you only need to know what will be evaluated before what.<br></li>
<li>Option: Check with the built-in &ldquo;ocaml.tailcall&rdquo; attribute.<br>
<code>[@tailcall]</code> can be applied in the recursive call (see below) in order to check if the call is a tail call. If it is no tail call, a warning is emitted.<br></li>
</ol>
</div>
<div id="outline-container-org1543ea6" class="outline-4">
<h4 id="org1543ea6"><a href="#org1543ea6">✘ Not tail-recursive</a></h4>
<div class="outline-text-4" id="text-org1543ea6">
<p>
Look at the recursive case (second branch). There&rsquo;s not only the call of the function <code>sum tl</code> itself, but another thing is happening too: the addition <code>hd +</code> … added to <i>what</i>? Yes, exactly … to the value of <code>sum tl</code> which has to be computed <i>before</i> the addition can happen. Ergo the recursive call is not the last thing, and therefore this is no &ldquo;tail call&rdquo;.<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">sum</span> <span class="org-variable-name">l</span> =   <span class="org-comment-delimiter">(* </span><span class="org-comment">function definition</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; 0
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; hd + sum tl<span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">&lt;-- recursive case</span><span class="org-comment-delimiter"> *)</span>

sum <span class="org-rainbow-delimiters-depth-1">[</span>1; 2; 3; 4; 5<span class="org-rainbow-delimiters-depth-1">]</span><span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">applying the function to a list of numbers</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Check for tail call</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">sum</span> <span class="org-variable-name">l</span> =
    <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; 0
    | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; hd + <span class="org-rainbow-delimiters-depth-1">(</span>sum <span class="org-tuareg-font-lock-attribute"><span class="org-rainbow-delimiters-depth-2">[</span></span><span class="org-tuareg-font-lock-attribute">@tailcall</span><span class="org-tuareg-font-lock-attribute"><span class="org-rainbow-delimiters-depth-2">]</span></span><span class="org-rainbow-delimiters-depth-1">)</span> tl<span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>
<p>
Check failed – warning:<br>
</p>
<pre class="example" id="org52f99c6">
Line 4, characters 23-42:
4 |     | hd :: tl -&gt; hd + (sum [@tailcall]) tl;;
                           ^^^^^^^^^^^^^^^^^^^^
Warning 51 [wrong-tailcall-expectation]: expected tailcall
val sum : int list -&gt; int = &lt;fun&gt;
</pre>
</div>
</div>
