blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
*** ✔ Tail-recursive
Look at the recursive case again. The addition now happens in place of an additional argument ~accu~. In fact, ~hd~ is added to the value of the accumulator, not to the value resulting from this recursive function call. That way, the addition can and will be computed before the function calls itself, which is therefore last thing happening. That's a "tail call".

#+begin_src ocaml
  let rec sumt accu l =       (* function definition with extra argument *)
    match l with
    | [] -> accu
    | hd :: tl -> sumt (accu + hd) tl;;   (* <-- recursive case *)

  sumt 0 [1; 2; 3; 4; 5];;   (* applying the function to a list of numbers *)
#+end_src

#+caption: Check for tail call
#+begin_src ocaml
  let rec sumt accu l =
    match l with
    | [] -> accu
    | hd :: tl -> (sumt [@tailcall]) (accu + hd) tl;;
#+end_src
Check passed – no warning:
#+begin_src ocaml
val sumt : int -> int list -> int = <fun>
#+end_src

How do we get there?

** Recipe for tail-recursive Functions

If you want to change a "naive" (non-tail-)recursive function into a tail-recursive function, you can follow these 4 steps ([[https://cs3110.github.io/textbook/chapters/basics/functions.html][source]]):

1. Change the original recursive function into a helper function
   - rename it (often named ~aux~ for "auxiliary")
   - add an extra argument: the accumulator, usually named ~accu~
2. Now write the wrapper function ~sum~ that calls the helper function. It passes the original base case’s return value as the initial value of the accumulator.
3. Change the helper function to return the accumulator in the base case.
4. Change the helper function’s recursive case. It now needs to do the extra work on the accumulator argument, before the recursive call. This is the only step that requires much ingenuity.

#+caption: BEFORE – not tail-recursive
#+begin_src ocaml
  let rec sum l =
    match l with
    | [] -> 0
    | hd :: tl -> hd + (sum tl);;   (* recursive case: no tail call *)
#+end_src

#+caption: AFTER – tail-recursive
#+begin_src ocaml
  let rec aux accu l =                   (* define the helper function *)
    match l with
    | [] -> accu                         (* base case returns the accumulator *)
    | hd :: tl -> aux (accu + hd) tl;;   (* recursive case: tail call *)

  let sum l =   (* define the wrapper function *)
    aux 0 l;;   (* call helper function with the base case value *)
#+end_src

Ok, now we've got 2 separate functions, which is not really handy, right? So let's put the helper function ~aux~ into the ~sum~ function:

#+begin_src ocaml
  let sum l =
    let rec aux accu l =
      match l with
      | [] -> accu
      | hd :: tl -> aux (accu + hd) tl in
    aux 0 l;;
#+end_src

And that's it! If you follow the recipe several times, you won't need it any more.

* Digesting really big CSV Files

Now we're leaving the safe haven of simple, constructed examples and plunge into real-world recursive functions, one by one.

Recursive functions in OCaml are easy to spot in the code (at least the ones /we/ defined), because of their ~let rec …~ syntax, which enables a function to call itself.

