blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-org03e41c4" class="outline-4">
<h4 id="org03e41c4"><a href="#org03e41c4">✔ Tail-recursive</a></h4>
<div class="outline-text-4" id="text-org03e41c4">
<p>
Look at the recursive case again. The addition now happens in place of an additional argument <code>accu</code>. In fact, <code>hd</code> is added to the value of the accumulator, not to the value resulting from this recursive function call. That way, the addition can and will be computed before the function calls itself, which is therefore last thing happening. That&rsquo;s a &ldquo;tail call&rdquo;.<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">sumt</span> <span class="org-variable-name">accu</span> <span class="org-variable-name">l</span> =       <span class="org-comment-delimiter">(* </span><span class="org-comment">function definition with extra argument</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; accu
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; sumt <span class="org-rainbow-delimiters-depth-1">(</span>accu + hd<span class="org-rainbow-delimiters-depth-1">)</span> tl<span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">&lt;-- recursive case</span><span class="org-comment-delimiter"> *)</span>

sumt 0 <span class="org-rainbow-delimiters-depth-1">[</span>1; 2; 3; 4; 5<span class="org-rainbow-delimiters-depth-1">]</span><span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">applying the function to a list of numbers</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Check for tail call</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">sumt</span> <span class="org-variable-name">accu</span> <span class="org-variable-name">l</span> =
  <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; accu
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; <span class="org-rainbow-delimiters-depth-1">(</span>sumt <span class="org-tuareg-font-lock-attribute"><span class="org-rainbow-delimiters-depth-2">[</span></span><span class="org-tuareg-font-lock-attribute">@tailcall</span><span class="org-tuareg-font-lock-attribute"><span class="org-rainbow-delimiters-depth-2">]</span></span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>accu + hd<span class="org-rainbow-delimiters-depth-1">)</span> tl<span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>
<p>
Check passed – no warning:<br>
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">val</span> <span class="org-function-name">sumt</span> : int -&gt; int list -&gt; int = &lt;<span class="org-keyword">fun</span>&gt;
</pre>
</div>

<p>
How do we get there?<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org283c178" class="outline-3">
<h3 id="org283c178"><a href="#org283c178">Recipe for tail-recursive Functions</a></h3>
<div class="outline-text-3" id="text-org283c178">
<p>
If you want to change a &ldquo;naive&rdquo; (non-tail-)recursive function into a tail-recursive function, you can follow these 4 steps (<a href="https://cs3110.github.io/textbook/chapters/basics/functions.html">source</a>):<br>
</p>

<ol class="org-ol">
<li>Change the original recursive function into a helper function<br>
<ul class="org-ul">
<li>rename it (often named <code>aux</code> for &ldquo;auxiliary&rdquo;)<br></li>
<li>add an extra argument: the accumulator, usually named <code>accu</code><br></li>
</ul></li>
<li>Now write the wrapper function <code>sum</code> that calls the helper function. It passes the original base case’s return value as the initial value of the accumulator.<br></li>
<li>Change the helper function to return the accumulator in the base case.<br></li>
<li>Change the helper function’s recursive case. It now needs to do the extra work on the accumulator argument, before the recursive call. This is the only step that requires much ingenuity.<br></li>
</ol>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>BEFORE – not tail-recursive</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">sum</span> <span class="org-variable-name">l</span> =
  <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; 0
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; hd + <span class="org-rainbow-delimiters-depth-1">(</span>sum tl<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">recursive case: no tail call</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>AFTER – tail-recursive</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">aux</span> <span class="org-variable-name">accu</span> <span class="org-variable-name">l</span> =                   <span class="org-comment-delimiter">(* </span><span class="org-comment">define the helper function</span><span class="org-comment-delimiter"> *)</span>
  <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; accu                         <span class="org-comment-delimiter">(* </span><span class="org-comment">base case returns the accumulator</span><span class="org-comment-delimiter"> *)</span>
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; aux <span class="org-rainbow-delimiters-depth-1">(</span>accu + hd<span class="org-rainbow-delimiters-depth-1">)</span> tl<span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">recursive case: tail call</span><span class="org-comment-delimiter"> *)</span>

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">sum</span> <span class="org-variable-name">l</span> =   <span class="org-comment-delimiter">(* </span><span class="org-comment">define the wrapper function</span><span class="org-comment-delimiter"> *)</span>
  aux 0 l<span class="org-tuareg-font-double-semicolon">;;</span>   <span class="org-comment-delimiter">(* </span><span class="org-comment">call helper function with the base case value</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>

<p>
Ok, now we&rsquo;ve got 2 separate functions, which is not really handy, right? So let&rsquo;s put the helper function <code>aux</code> into the <code>sum</code> function:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">sum</span> <span class="org-variable-name">l</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">aux</span> <span class="org-variable-name">accu</span> <span class="org-variable-name">l</span> =
    <span class="org-keyword">match</span> l <span class="org-keyword">with</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; accu
    | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; aux <span class="org-rainbow-delimiters-depth-1">(</span>accu + hd<span class="org-rainbow-delimiters-depth-1">)</span> tl <span class="org-tuareg-font-lock-governing">in</span>
  aux 0 l<span class="org-tuareg-font-double-semicolon">;;</span>
</pre>
</div>

<p>
And that&rsquo;s it! If you follow the recipe several times, you won&rsquo;t need it any more.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org5135167" class="outline-2">
<h2 id="org5135167"><a href="#org5135167">Digesting really big CSV Files</a></h2>
<div class="outline-text-2" id="text-org5135167">
<p>
Now we&rsquo;re leaving the safe haven of simple, constructed examples and plunge into real-world recursive functions, one by one.<br>
</p>

<p>
Recursive functions in OCaml are easy to spot in the code (at least the ones <i>we</i> defined), because of their <code>let rec …</code> syntax, which enables a function to call itself.<br>
</p>
</div>
