blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
** Fixing the »Clean« Function

The ~clean~ function receives the whole CSV data structure ~tab~ (table), which is essentially a long /list/ containing /association lists/ (rows) of /key-value pairs/. The latter represent single "table cells", but each value (cell content) associated with its corresponding key (column header).

Ah yes, not to forget: When writing about static functional languages, it's obligatory to barf out totally obvious type signatures like this. It's just a way to describe what form of data a function accepts for an argument, and what form the returned value will be:

#+caption: Type signature
#+begin_src ocaml
  val clean : (string * 'a) list list -> (string * 'a) list list = <fun>
#+end_src

#+caption: BEFORE – causing a stack overflow
#+begin_src ocaml
  (** Drops the columns that are not specified in the template *)
  let clean tab =
    let tpl_file = open_in "template.csv" in
    let tpl = tpl_file
              |> Csv.of_channel ~has_header:true
              |> Csv.Rows.header in
    let () = close_in tpl_file in
    let rec remove_cols tpl row =   (* 1 *)
      match row with
      | [] -> []
      | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_cols tpl tl
      | _ :: tl -> remove_cols tpl tl in
    List.map (remove_cols tpl) tab   (* 2 *)
#+end_src

Let's zoom in to the inner function ~remove_cols~ (1), which iterates through a single /association list/ (row) specified by the =template.csv= in order to collect certain /key-value pairs/ (column headers, cell content).

"*Wait … ROW you said?* When the CSVs have only 14 columns, then it means a list containing the data of a row is at most 14 elements long. A non-tail-recursive function eating this tiny list can hardly be the reason for the stack overflow!"

Very true Sherlock. As long as we don't clean CSVs with many thousands of columns per row, we ain't get into trouble because of that. So what's causing the stack overflow then?

Well, there's also the function ~List.map~ (2) from OCaml's [[https://ocaml.org/api/List.html][List module]] that iterates over the list ~tab~ containing the 500k CSV rows in order to apply ~remove_cols~ to each one of them. Here's that mighty beast:

*** Tail-recursive or not?

#+caption: OCaml's official implementation
#+begin_src ocaml
  let rec map f = function
      [] -> []
    | a::l -> let r = f a in r :: map f l
#+end_src

Looking at the recursive case ~r :: map f l~ where ~r~ is put into a list (via "cons" ~::~ operator) that still has to be computed by the recursive call(s) ~map f l~ tells us … what? That this is no tail call, so the function is not tail-recursive.

I'm quite surprised that such a fundamental function like ~map~ is not implemented tail-recursively by default. I mean OCaml is a functional programming language after all. Well, non-tail-recursive functions are marked in the [[https://ocaml.org/api/List.html][List module documentation]]).

