blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-org97ec155" class="outline-3">
<h3 id="org97ec155"><a href="#org97ec155">Fixing the »Clean« Function</a></h3>
<div class="outline-text-3" id="text-org97ec155">
<p>
The <code>clean</code> function receives the whole CSV data structure <code>tab</code> (table), which is essentially a long <i>list</i> containing <i>association lists</i> (rows) of <i>key-value pairs</i>. The latter represent single &ldquo;table cells&rdquo;, but each value (cell content) associated with its corresponding key (column header).<br>
</p>

<p>
Ah yes, not to forget: When writing about static functional languages, it&rsquo;s obligatory to barf out totally obvious type signatures like this. It&rsquo;s just a way to describe what form of data a function accepts for an argument, and what form the returned value will be:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Type signature</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">val</span> <span class="org-function-name">clean</span> : <span class="org-rainbow-delimiters-depth-1">(</span>string * 'a<span class="org-rainbow-delimiters-depth-1">)</span> list list -&gt; <span class="org-rainbow-delimiters-depth-1">(</span>string * 'a<span class="org-rainbow-delimiters-depth-1">)</span> list list = &lt;<span class="org-keyword">fun</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>BEFORE – causing a stack overflow</label><pre class="src src-ocaml"><span class="org-doc">(** Drops the columns that are not specified in the template *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">clean</span> <span class="org-variable-name">tab</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tpl_file</span> = open_in <span class="org-string">"template.csv"</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tpl</span> = tpl_file
            <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.</span>of_channel <span class="org-tuareg-font-lock-label">~has_header</span>:<span class="org-constant">true</span>
            <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.Rows.</span>header <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-rainbow-delimiters-depth-1">()</span> = close_in tpl_file <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">remove_cols</span> <span class="org-variable-name">tpl</span> <span class="org-variable-name">row</span> =   <span class="org-comment-delimiter">(* </span><span class="org-comment">1</span><span class="org-comment-delimiter"> *)</span>
    <span class="org-keyword">match</span> row <span class="org-keyword">with</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
    | <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl <span class="org-keyword">when</span> <span class="org-tuareg-font-lock-module">List.</span>mem k tpl -&gt; <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> remove_cols tpl tl
    | _ <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; remove_cols tpl tl <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-module">List.</span>map <span class="org-rainbow-delimiters-depth-1">(</span>remove_cols tpl<span class="org-rainbow-delimiters-depth-1">)</span> tab   <span class="org-comment-delimiter">(* </span><span class="org-comment">2</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>

<p>
Let&rsquo;s zoom in to the inner function <code>remove_cols</code> (1), which iterates through a single <i>association list</i> (row) specified by the <code>template.csv</code> in order to collect certain <i>key-value pairs</i> (column headers, cell content).<br>
</p>

<p>
&ldquo;<b>Wait … ROW you said?</b> When the CSVs have only 14 columns, then it means a list containing the data of a row is at most 14 elements long. A non-tail-recursive function eating this tiny list can hardly be the reason for the stack overflow!&rdquo;<br>
</p>

<p>
Very true Sherlock. As long as we don&rsquo;t clean CSVs with many thousands of columns per row, we ain&rsquo;t get into trouble because of that. So what&rsquo;s causing the stack overflow then?<br>
</p>

<p>
Well, there&rsquo;s also the function <code>List.map</code> (2) from OCaml&rsquo;s <a href="https://ocaml.org/api/List.html">List module</a> that iterates over the list <code>tab</code> containing the 500k CSV rows in order to apply <code>remove_cols</code> to each one of them. Here&rsquo;s that mighty beast:<br>
</p>
</div>
<div id="outline-container-orgfa48601" class="outline-4">
<h4 id="orgfa48601"><a href="#orgfa48601">Tail-recursive or not?</a></h4>
<div class="outline-text-4" id="text-orgfa48601">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>OCaml&rsquo;s official implementation</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">map</span> <span class="org-variable-name">f</span> = <span class="org-keyword">function</span>
    <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
  | a<span class="org-tuareg-font-lock-constructor">::</span>l -&gt; <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">r</span> = f a <span class="org-tuareg-font-lock-governing">in</span> r <span class="org-tuareg-font-lock-constructor">::</span> map f l
</pre>
</div>

<p>
Looking at the recursive case <code>r :: map f l</code> where <code>r</code> is put into a list (via &ldquo;cons&rdquo; <code>::</code> operator) that still has to be computed by the recursive call(s) <code>map f l</code> tells us … what? That this is no tail call, so the function is not tail-recursive.<br>
</p>

<p>
I&rsquo;m quite surprised that such a fundamental function like <code>map</code> is not implemented tail-recursively by default. I mean OCaml is a functional programming language after all. Well, non-tail-recursive functions are marked in the <a href="https://ocaml.org/api/List.html">List module documentation</a>).<br>
</p>
</div>
</div>
