blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
*** What now?

Let's look for an alternative in the [[https://ocaml.org/api/List.html][List module]] … Oh, what do we have here? "~rev_map f l~ gives the same result as ~List.rev (List.map f l)~, but is /tail-recursive/ and more efficient." Mmmh. Ok, I see. There it is.

We could use ~List.rev_map~ instead of ~List.map~ then. Anything else? Yes, there's just … it returns the list in /reverse order/, as the name suggests … Well then we'll reverse the reversed list again via ~List.rev~. And since we'll need a tail-recursive map function quite more often anyway, we can just wrap both in one and have our own tail-recursive "map" function:

#+begin_src ocaml
  (** Tail-recursive alternative to [List.map] *)
  let mapt f l =
    List.rev (List.rev_map f l)
#+end_src

"But isn't the additional step of reversing the linked list inefficient and slows down the program?" I don't know, but I'm curious too. So at the end of this walktrough, let's do a furious race between the different variants. But – patience, please. For the sake of completeness, here's the fixed function, with the single change in the last line:

#+begin_src ocaml
  (** Drops the columns that are not specified in the template *)
  let clean tab =
    let tpl_file = open_in "template.csv" in
    let tpl = tpl_file
              |> Csv.of_channel ~has_header:true
              |> Csv.Rows.header in
    let () = close_in tpl_file in
    let rec remove_cols tpl row =
      match row with
      | [] -> []
      | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_cols tpl tl
      | _ :: tl -> remove_cols tpl tl in
    mapt (remove_cols tpl) tab   (* <-- using our mapt here instead of List.map *)
#+end_src

