blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-orgd333935" class="outline-4">
<h4 id="orgd333935"><a href="#orgd333935">What now?</a></h4>
<div class="outline-text-4" id="text-orgd333935">
<p>
Let&rsquo;s look for an alternative in the <a href="https://ocaml.org/api/List.html">List module</a> … Oh, what do we have here? &ldquo;<code>rev_map f l</code> gives the same result as <code>List.rev (List.map f l)</code>, but is <i>tail-recursive</i> and more efficient.&rdquo; Mmmh. Ok, I see. There it is.<br>
</p>

<p>
We could use <code>List.rev_map</code> instead of <code>List.map</code> then. Anything else? Yes, there&rsquo;s just … it returns the list in <i>reverse order</i>, as the name suggests … Well then we&rsquo;ll reverse the reversed list again via <code>List.rev</code>. And since we&rsquo;ll need a tail-recursive map function quite more often anyway, we can just wrap both in one and have our own tail-recursive &ldquo;map&rdquo; function:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-doc">(** Tail-recursive alternative to </span><span class="org-tuareg-font-lock-doc-markup">[</span><span class="org-tuareg-font-lock-module">List.</span>map<span class="org-tuareg-font-lock-doc-markup">]</span><span class="org-doc"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">mapt</span> <span class="org-variable-name">f</span> <span class="org-variable-name">l</span> =
  <span class="org-tuareg-font-lock-module">List.</span>rev <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tuareg-font-lock-module">List.</span>rev_map f l<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
&ldquo;But isn&rsquo;t the additional step of reversing the linked list inefficient and slows down the program?&rdquo; I don&rsquo;t know, but I&rsquo;m curious too. So at the end of this walktrough, let&rsquo;s do a furious race between the different variants. But – patience, please. For the sake of completeness, here&rsquo;s the fixed function, with the single change in the last line:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-doc">(** Drops the columns that are not specified in the template *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">clean</span> <span class="org-variable-name">tab</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tpl_file</span> = open_in <span class="org-string">"template.csv"</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tpl</span> = tpl_file
            <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.</span>of_channel <span class="org-tuareg-font-lock-label">~has_header</span>:<span class="org-constant">true</span>
            <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.Rows.</span>header <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-rainbow-delimiters-depth-1">()</span> = close_in tpl_file <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">remove_cols</span> <span class="org-variable-name">tpl</span> <span class="org-variable-name">row</span> =
    <span class="org-keyword">match</span> row <span class="org-keyword">with</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
    | <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl <span class="org-keyword">when</span> <span class="org-tuareg-font-lock-module">List.</span>mem k tpl -&gt; <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> remove_cols tpl tl
    | _ <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; remove_cols tpl tl <span class="org-tuareg-font-lock-governing">in</span>
  mapt <span class="org-rainbow-delimiters-depth-1">(</span>remove_cols tpl<span class="org-rainbow-delimiters-depth-1">)</span> tab   <span class="org-comment-delimiter">(* </span><span class="org-comment">&lt;-- using our mapt here instead of List.map</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>
</div>
</div>
</div>
