blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
** Fixing the »Dissoc« Function

It may not seem obvious, but ~dissoc~ is actually the definition of a function that takes one argument: the long list (table) holding the association lists (rows); each of them containing key-value pairs (column-header, cell content).

#+caption: Type signature
#+begin_src ocaml
  val dissoc : ('a * 'a) list list -> 'a list list = <fun>
#+end_src

#+caption: BEFORE – causing a stack overflow
#+begin_src ocaml
  (** Transforms the (key, value) data structure into lists representing lines *)
  let dissoc =
    let rec get_keys =
      function
      | [] -> []
      | (k, _) :: tl -> k :: get_keys tl in
    let rec get_values =
      function
      | [] -> []
      | (_, v) :: tl -> v :: get_values tl in
    function
    | [] -> []                (* ↓ change this for mapt *)
    | hd :: tl -> get_keys hd :: List.map get_values (hd :: tl)
#+end_src

The CSV files we've been using for the benchmark have thousands of rows, but only 14 columns. Both inner functions ~get_keys~ and ~get_values~ iterate through the "rows", each of them containing as many key-value pairs as there are columns in the CSV.

So we're getting away with those functions not being tail-recursive, as long as we feed them only "small" rows. But how small is "small"? The documentation says "not longer than about 10000 elements"; but this is no absolute guideline.

Over all, same here as before with the ~clean~ function: ~List.map~ applies the function ~get_values~ to each of the 500k rows from the CSV, causing a stack overflow itself due its own non-tail-recursive implementation. Again, let's replace ~List.map~ with our tail-recursive alternative ~mapt~ and we're done:

#+caption: AFTER – using the tail-recursive 'mapt' alternative
#+begin_src ocaml
  (** Transforms the (key, value) data structure into lists representing lines *)
  let dissoc =
    let rec get_keys =
      function
      | [] -> []
      | (k, _) :: tl -> k :: get_keys tl in
    let rec get_values =
      function
      | [] -> []
      | (_, v) :: tl -> v :: get_values tl in
    function
    | [] -> []                (* ↓ using our tail-recursive version *)
    | hd :: tl -> get_keys hd :: mapt get_values (hd :: tl)
#+end_src

When we test the CSV Cleaner again in the toplevel, we should find a new CSV file =output.csv= in the project directory – even if we process a CSV file with 5 million lines.

* Oh how unsatisfying that was!

We've just fixed the program by changing a tiny function in two places. Can you feel the emptiness, too? But you know what? Let's over-engineer the shit out of it and make *everything* tail-recursive, so the CSV cleaner can digest CSVs with as many rows AND columns as … I dont know … incredibly … many! Probably. Let's see.

** Bullet-proof »Clean« Function

Since we have already fixed the function ~clean~ by writing a tail-recursive alternative for ~List.map~, we are now focussing on the inner function ~remove_cols~ that iterates over a single association list (row) in order to work on the key-value pairs:

#+begin_src ocaml
  let rec remove_cols tpl row =
    match row with
    | [] -> []                                                           (* 1 *)
    | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_cols tpl tl   (* 2 *)
    | _ :: tl -> remove_cols tpl tl                                      (* 3 *)
#+end_src

