blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-org02949ca" class="outline-3">
<h3 id="org02949ca"><a href="#org02949ca">Fixing the »Dissoc« Function</a></h3>
<div class="outline-text-3" id="text-org02949ca">
<p>
It may not seem obvious, but <code>dissoc</code> is actually the definition of a function that takes one argument: the long list (table) holding the association lists (rows); each of them containing key-value pairs (column-header, cell content).<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>Type signature</label><pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">val</span> <span class="org-function-name">dissoc</span> : <span class="org-rainbow-delimiters-depth-1">(</span>'a * 'a<span class="org-rainbow-delimiters-depth-1">)</span> list list -&gt; 'a list list = &lt;<span class="org-keyword">fun</span>&gt;
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>BEFORE – causing a stack overflow</label><pre class="src src-ocaml"><span class="org-doc">(** Transforms the (key, value) data structure into lists representing lines *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">dissoc</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-variable-name">get_keys</span> =
    <span class="org-keyword">function</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
    | <span class="org-rainbow-delimiters-depth-1">(</span>k, _<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; k <span class="org-tuareg-font-lock-constructor">::</span> get_keys tl <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-variable-name">get_values</span> =
    <span class="org-keyword">function</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
    | <span class="org-rainbow-delimiters-depth-1">(</span>_, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; v <span class="org-tuareg-font-lock-constructor">::</span> get_values tl <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-keyword">function</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>                <span class="org-comment-delimiter">(* </span><span class="org-comment">&#8595; change this for mapt</span><span class="org-comment-delimiter"> *)</span>
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; get_keys hd <span class="org-tuareg-font-lock-constructor">::</span> <span class="org-tuareg-font-lock-module">List.</span>map get_values <span class="org-rainbow-delimiters-depth-1">(</span>hd <span class="org-tuareg-font-lock-constructor">::</span> tl<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
The CSV files we&rsquo;ve been using for the benchmark have thousands of rows, but only 14 columns. Both inner functions <code>get_keys</code> and <code>get_values</code> iterate through the &ldquo;rows&rdquo;, each of them containing as many key-value pairs as there are columns in the CSV.<br>
</p>

<p>
So we&rsquo;re getting away with those functions not being tail-recursive, as long as we feed them only &ldquo;small&rdquo; rows. But how small is &ldquo;small&rdquo;? The documentation says &ldquo;not longer than about 10000 elements&rdquo;; but this is no absolute guideline.<br>
</p>

<p>
Over all, same here as before with the <code>clean</code> function: <code>List.map</code> applies the function <code>get_values</code> to each of the 500k rows from the CSV, causing a stack overflow itself due its own non-tail-recursive implementation. Again, let&rsquo;s replace <code>List.map</code> with our tail-recursive alternative <code>mapt</code> and we&rsquo;re done:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>AFTER – using the tail-recursive &rsquo;mapt&rsquo; alternative</label><pre class="src src-ocaml"><span class="org-doc">(** Transforms the (key, value) data structure into lists representing lines *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">dissoc</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-variable-name">get_keys</span> =
    <span class="org-keyword">function</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
    | <span class="org-rainbow-delimiters-depth-1">(</span>k, _<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; k <span class="org-tuareg-font-lock-constructor">::</span> get_keys tl <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-variable-name">get_values</span> =
    <span class="org-keyword">function</span>
    | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
    | <span class="org-rainbow-delimiters-depth-1">(</span>_, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; v <span class="org-tuareg-font-lock-constructor">::</span> get_values tl <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-keyword">function</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>                <span class="org-comment-delimiter">(* </span><span class="org-comment">&#8595; using our tail-recursive version</span><span class="org-comment-delimiter"> *)</span>
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; get_keys hd <span class="org-tuareg-font-lock-constructor">::</span> mapt get_values <span class="org-rainbow-delimiters-depth-1">(</span>hd <span class="org-tuareg-font-lock-constructor">::</span> tl<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
When we test the CSV Cleaner again in the toplevel, we should find a new CSV file <code>output.csv</code> in the project directory – even if we process a CSV file with 5 million lines.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org83a6aa3" class="outline-2">
<h2 id="org83a6aa3"><a href="#org83a6aa3">Oh how unsatisfying that was!</a></h2>
<div class="outline-text-2" id="text-org83a6aa3">
<p>
We&rsquo;ve just fixed the program by changing a tiny function in two places. Can you feel the emptiness, too? But you know what? Let&rsquo;s over-engineer the shit out of it and make <b>everything</b> tail-recursive, so the CSV cleaner can digest CSVs with as many rows AND columns as … I dont know … incredibly … many! Probably. Let&rsquo;s see.<br>
</p>
</div>
<div id="outline-container-org46693fb" class="outline-3">
<h3 id="org46693fb"><a href="#org46693fb">Bullet-proof »Clean« Function</a></h3>
<div class="outline-text-3" id="text-org46693fb">
<p>
Since we have already fixed the function <code>clean</code> by writing a tail-recursive alternative for <code>List.map</code>, we are now focussing on the inner function <code>remove_cols</code> that iterates over a single association list (row) in order to work on the key-value pairs:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">remove_cols</span> <span class="org-variable-name">tpl</span> <span class="org-variable-name">row</span> =
  <span class="org-keyword">match</span> row <span class="org-keyword">with</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>                                                           <span class="org-comment-delimiter">(* </span><span class="org-comment">1</span><span class="org-comment-delimiter"> *)</span>
  | <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl <span class="org-keyword">when</span> <span class="org-tuareg-font-lock-module">List.</span>mem k tpl -&gt; <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> remove_cols tpl tl   <span class="org-comment-delimiter">(* </span><span class="org-comment">2</span><span class="org-comment-delimiter"> *)</span>
  | _ <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; remove_cols tpl tl                                      <span class="org-comment-delimiter">(* </span><span class="org-comment">3</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>
</div>
