blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
*** What is it doing?

#+caption: Type signature
#+begin_src ocaml
  val remove_cols : 'a list -> ('a * 'b) list -> ('a * 'b) list = <fun>
#+end_src

The function takes 2 arguments:

- ~tpl~: the template is one simple /list/ ~'a list~ that holds the column headers of all columns to keep, while all others are getting dropped. This list looks like so:

#+caption: Template data structure ["columnheader"; "columnheader"]
#+begin_src ocaml
  ["b"; "c";]   (* list of column headers specifying the columns to keep *)
#+end_src

- ~row~: is a /list of tuples/ ~('a * 'b) list~. Those are key-value pairs; the key represents a column header, and the value represents the cell content:

#+caption: Row data structure [("columnheader", "cellcontent"); … ]
#+begin_src ocaml
  [("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")]   (* a single CSV row *)
#+end_src

*** How does the inner Function work?

1. If the function receives a list ~row~ with nothing in it -> return just an empty list.
2. Destructure the list ~row~ into the first key-value pair ~(k, v)~, while referring to its parts with ~k~ for the "key" and ~v~ for the "value"; bind ~tl~ to the tail (rest) of the list (which is a list itself) – but only ~when~ the key ~k~ is also member of the template ~tpl~ -> Then take the corresponding key-value pair … and again and again … put these into a list, and return that list eventually.
3. The 3rd branch takes over if the 2nd branch encounters a key ~k~ that is not member of the template ~tpl~ (those key-value pairs will be ignored). The 3rd branch just continues to call the function again with the next element from the tail ~tl~ of the list ~row~.

*** Making it tail-recursive

#+caption: BEFORE – not tail-recursive
#+begin_src ocaml
  let rec remove_cols tpl row =
    match row with
    | [] -> []
    | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_cols tpl tl (* 1 *)
    | _ :: tl -> remove_cols tpl tl (* <- that is already a tail call *)
#+end_src

[[*Recipe for tail-recursive Functions][Maybe look at the recipe again]]. The only part that can be kinda tricky is to rearrange the recursive case (1). The call to the function itself has to be the last thing happening, so that no other computation tries to use the value of that particular recursive call afterwards (within this recursive case/cycle).

#+caption: AFTER – helper function (1) and separate wrapper function (2)
#+begin_src ocaml
  let rec aux accu tpl row =   (* 1 *)
    match row with
    | [] -> accu   (* <-- replace the base case with the accumulator *)
    | (k, v) :: tl when List.mem k tpl -> aux ((k, v) :: accu) tpl tl
    | _ :: tl -> aux accu tpl tl

  let remove_cols tpl row =   (* 2 *)
    aux [] tpl row   (* <-- set the empty list [] as the base case *)
#+end_src

Let's merge that into one single function:

#+caption: AFTER – helper function (1) inside the wrapper function (2)
#+begin_src ocaml
  let remove_cols tpl row =   (* 2 *)
    let rec aux accu tpl row =   (* 1 *)
      match row with
      | [] -> accu
      | (k, v) :: tl when List.mem k tpl -> aux ((k, v) :: accu) tpl tl
      | _ :: tl -> aux accu tpl tl in
    aux [] tpl row
#+end_src

