blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
*** Quick Test using the Toplevel (REPL)

How can we call this function and how should the arguments be like? The type signature tells us:

#+caption: Yeah, hello again type signature. BFF!
#+begin_src ocaml
  val remove_cols : 'a list -> ('a * 'b) list -> ('a * 'b) list = <fun>
#+end_src

- The 1st argument ~tpl~ must be a list of single elements
- The 2nd argument ~row~ must be a list of tuples with 2 elements each (key, value)
- The result will also be a list of tuples with 2 elements each (key, value)

So for a quick test, we can just provide the arguments as follows:

#+caption: Function call with two arguments (lists)
#+begin_src ocaml
  remove_cols ["b"; "c";] [("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")]
           (* ↑ template  ↑ row *)
#+end_src

#+caption: Result – all the other key-value pairs got dropped
#+begin_src ocaml
  - : (string * string) list = [("c", "3"); ("b", "2")]
#+end_src

**** Noticed something?

The key-value pairs came out in reverse order! There is one difference compared to the non-tail-recursive function: the helper function adds each key-value pair in front of the accumulator list ~accu~, so the first pair found will eventually be at the end of the list.

This is quite a common thing when recursively working on lists. What we can do, is to reverse the accumulator with ~List.rev~, which itself /is/ tail-recursive:

#+begin_src ocaml
  let remove_cols tpl row =
    let rec aux accu tpl row =
      match row with
      | [] -> List.rev accu  (* <-- reverse the accumulator *)
      | (k, v) :: tl when List.mem k tpl -> aux ((k, v) :: accu) tpl tl
      | _ :: tl -> aux accu tpl tl in
    aux [] tpl row
#+end_src

*** Putting all together, going fully tail-recursive

The ~remove_cols~ function is now tail-recursive and should be able to handle anything you throw at it. And off we go, putting it right back into the =csvcleaner.ml= file:

#+begin_src ocaml
  (** Drops the columns that are not specified in the template *)
  let clean tab =
    let tpl_file = open_in "template.csv" in
    let tpl = tpl_file
              |> Csv.of_channel ~has_header:true
              |> Csv.Rows.header in
    let () = close_in tpl_file in
    let remove_cols tpl row =     (* Here starts our new tail-recursive function *)
      let rec aux accu tpl row =
        match row with
        | [] -> List.rev accu
        | (k, v) :: tl when List.mem k tpl -> aux ((k, v) :: accu) tpl tl
        | _ :: tl -> aux accu tpl tl in
      aux [] tpl row in           (* ... and it ends here *)
    mapt (remove_cols tpl) tab
#+end_src

