blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
** Bullet-proof »Dissoc« Function

We fixed the outer function ~dissoc~ already, now let's improve both inner functions ~get_keys~ and ~get_values~ to iterate over "rows" of arbitrary length without causing a stack overflow. CSV files with plenty of columns shouldn't pose any problem afterwards.

#+begin_src ocaml
  (** Transforms the key-value data structure into lists representing lines *)
  let dissoc =
    let rec get_keys =   (* 1 *)
      function
      | [] -> []
      | (k, _) :: tl -> k :: get_keys tl in
    let rec get_values =   (* 2 *)
      function
      | [] -> []
      | (_, v) :: tl -> v :: get_values tl in
    function
    | [] -> []
    | hd :: tl -> get_keys hd :: mapt get_values (hd :: tl)
#+end_src

*** What is it doing?

#+caption: Type signature
#+begin_src ocaml
  val dissoc : ('a * 'a) list list -> 'a list list = <fun>
#+end_src

The ~dissoc~ function takes one argument, which is a /list of association lists/ created by ~clean~, containing only the columns specified by the template. Here you see how the structure literally looks like:

#+caption: BEFORE – the whole CSV data is a list of association lists
#+begin_src ocaml
  [[("b", "2"); ("d", "4")];
   [("b", "6"); ("d", "8")];
   [("b", "10"); ("d", "12")]]
#+end_src

The ~dissoc~ function splits the keys from the values and gathers both separately in order to change the structure into something that comes a bit closer to how a CSV file looks like:

1. the first list becoming the first line a.k.a. table head
2. and the following lists becoming the table rows

#+caption: AFTER – the whole CSV data is a list of lists
#+begin_src ocaml
  [["b"; "d"];     (* 1 *)
   ["2"; "4"];     (* 2 *)
   ["6"; "8"];     (* 2 *)
   ["10"; "12"]]   (* 2 *)
#+end_src

*** How do the inner Functions work?

#+caption: BEFORE – not tail-recursive
#+begin_src ocaml
  let rec get_keys =   (* 1 *)
    function
    | [] -> []
    | (k, _) :: tl -> k :: get_keys tl   (* ← ? *)

  let rec get_values =   (* 2 *)
    function
    | [] -> []
    | (_, v) :: tl -> v :: get_values tl   (* ← ? *)
#+end_src

1. ~val get_keys : ('a * 'b) list -> 'a list = <fun>~
   The outer function ~dissoc~ applies ~get_keys~ to each key-value pair of the first row, in order to collect only the keys and put them in a list.
2. ~val get_values : ('a * 'b) list -> 'b list = <fun>~
   The outer function ~dissoc~ applies ~get_values~ to each key-value pair of /all rows/ in order to make a list of values from each row.

