blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
*** Making both inner Functions tail-recursive

Stoooop! Ok. Nah don't look further down. Wanna try to rewrite the functions on your own? I guess you propably don't even need the [[*Recipe for tail-recursive Functions][recipe]] any more?

#+caption: AFTER – tail-recursive
#+begin_src ocaml
  let get_keys row =             (* Wrapper function *)
    let rec aux accu =           (* Helper function … *)
      function
      | [] -> accu               (* … with accumulator *)
      | (k, _) :: tl -> aux (k :: accu) tl in
    List.rev (aux [] row)        (* Don't forget to reverse the returned list *)

  let get_values row =           (* Wrapper function *)
    let rec aux accu =           (* Helper function … *)
      function
      | [] -> accu               (* … with accumulator *)
      | (_, v) :: tl -> aux (v :: accu) tl in
    List.rev (aux [] row)        (* Reverse the returned list *)
#+end_src

*** Putting all together, one more time

Just for the record, that's how the whole ~dissoc~ function looks afterwards:

#+begin_src ocaml
let dissoc =
  let get_keys row =
    let rec aux accu =
      function
      | [] -> accu
      | (k, _) :: tl -> aux (k :: accu) tl in
    List.rev (aux [] row) in
  let get_values row =
    let rec aux accu =
      function
      | [] -> accu
      | (_, v) :: tl -> aux (v :: accu) tl in
    List.rev (aux [] row) in
  function
  | [] -> []
  | hd :: tl -> get_keys hd :: mapt get_values (hd :: tl)
#+end_src

*** Quick Test in the Toplevel (REPL)

#+caption: Applying the function to some data in the shape of ~('a * 'a) list list~
#+begin_src ocaml
  dissoc [[("b", "2"); ("d", "4")];
          [("b", "6"); ("d", "8")];
          [("b", "10"); ("d", "12")]];;
#+end_src

#+caption: Result – the same data, but transformed into a ~string list list~
#+begin_src ocaml
  - : string list list = [["b"; "d"];
                          ["2"; "4"];
                          ["6"; "8"];
                          ["10"; "12"]]
#+end_src

This list is then passed to the next function ~save~ to write the data to disk as a CSV file.

