blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
* Final Comparison

Is there a difference in speed regarding the three implementations? Let's find out. There we have:

- *"no tr"* the original variant without tail recursion
- *"mapt only"* where we only changed ~List.map~ for a tail-recursive ~mapt~
- *"full tr"* in which we've made the row-functions tail-recursive too

There is to say that I've been a bit lazy and just picked the fastest run out of ten for each variant per CSV size, so the method is probably as scientific as a lizard race in Thailand.

| Variant   |    Rows | Columns | Size MiB | User sec | System sec | Elapsed sec |
|-----------+---------+---------+----------+----------+------------+-------------|
| no tr     |  100000 |      14 |     11.9 |     0.59 |       0.05 |        0.65 |
| mapt only |  100000 |      14 |     11.9 |     0.58 |       0.06 |        0.65 |
| full tr   |  100000 |      14 |     11.9 |     0.62 |       0.02 |        0.65 |
|-----------+---------+---------+----------+----------+------------+-------------|
| no tr     |  200000 |      14 |     23.4 |     1.27 |       0.12 |        1.41 |
| mapt only |  200000 |      14 |     23.4 |     1.32 |       0.06 |        1.40 |
| full tr   |  200000 |      14 |     23.4 |     1.30 |       0.08 |        1.39 |
|-----------+---------+---------+----------+----------+------------+-------------|
| no tr     |  300000 |      14 |     35.1 |     2.01 |       0.11 |        2.13 |
| mapt only |  300000 |      14 |     35.1 |     1.92 |       0.17 |        2.10 |
| full tr   |  300000 |      14 |     35.1 |     1.97 |       0.12 |        2.11 |
|-----------+---------+---------+----------+----------+------------+-------------|
| no tr     |  500000 |      14 |     59.5 |    CRASH |      CRASH |       CRASH |
| mapt only |  500000 |      14 |     59.5 |     3.15 |       0.15 |        3.32 |
| full tr   |  500000 |      14 |     59.5 |     3.13 |       0.17 |        3.32 |
|-----------+---------+---------+----------+----------+------------+-------------|
| no tr     | 1000000 |      14 |    119.0 |    CRASH |      CRASH |       CRASH |
| mapt only | 1000000 |      14 |    119.0 |     6.47 |       0.35 |        6.86 |
| full tr   | 1000000 |      14 |    119.0 |     6.55 |       0.34 |        6.92 |
|-----------+---------+---------+----------+----------+------------+-------------|
| no tr     | 5000000 |      14 |    595.1 |    CRASH |      CRASH |       CRASH |
| mapt only | 5000000 |      14 |    595.1 |    31.27 |       1.90 |       33.28 |
| full tr   | 5000000 |      14 |    595.1 |    31.59 |       1.76 |       33.46 |

One might assume the tail-recursive CSV Cleaner variants ("mapt only", "full tr") were a bit faster than the one implementation "no tr" without tail recursion. When we compare both tail-recursive variants with each other, they seem to come pretty close, while the "full tr" seems a little behind.

But in fact I think those differences are insignificant, because the variants are often only hundereds of milliseconds apart, and the results sometimes overlap. I guess that things like file system cache, processor cache, other background processes etc. matter much more.

* Conclusion

It makes sense to write functions in the tail-recursive style, since it eliminates the chance to run into a "low-hanging" ressource limit unneccessarily. But the next limit lurks just around the corner: the amount of total memory available. I did some runs on CSV files with 300000 rows but this time 400 columns instead of 14, and the process quickly ate up 16 GB RAM + 4 GB swap space and got killed by the OS eventually.

Anyway, I had fun to gnaw on those larger files. Probably I should have used a data structure other than linked lists in the first place; and I'm quite optimistic the whole task could be done more efficiently.

