blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-orgf84d0b8" class="outline-2">
<h2 id="orgf84d0b8"><a href="#orgf84d0b8">Final Comparison</a></h2>
<div class="outline-text-2" id="text-orgf84d0b8">
<p>
Is there a difference in speed regarding the three implementations? Let&rsquo;s find out. There we have:<br>
</p>

<ul class="org-ul">
<li><b>&ldquo;no tr&rdquo;</b> the original variant without tail recursion<br></li>
<li><b>&ldquo;mapt only&rdquo;</b> where we only changed <code>List.map</code> for a tail-recursive <code>mapt</code><br></li>
<li><b>&ldquo;full tr&rdquo;</b> in which we&rsquo;ve made the row-functions tail-recursive too<br></li>
</ul>

<p>
There is to say that I&rsquo;ve been a bit lazy and just picked the fastest run out of ten for each variant per CSV size, so the method is probably as scientific as a lizard race in Thailand.<br>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variant</th>
<th scope="col" class="org-right">Rows</th>
<th scope="col" class="org-right">Columns</th>
<th scope="col" class="org-right">Size MiB</th>
<th scope="col" class="org-right">User sec</th>
<th scope="col" class="org-right">System sec</th>
<th scope="col" class="org-right">Elapsed sec</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">no tr</td>
<td class="org-right">100000</td>
<td class="org-right">14</td>
<td class="org-right">11.9</td>
<td class="org-right">0.59</td>
<td class="org-right">0.05</td>
<td class="org-right">0.65</td>
</tr>

<tr>
<td class="org-left">mapt only</td>
<td class="org-right">100000</td>
<td class="org-right">14</td>
<td class="org-right">11.9</td>
<td class="org-right">0.58</td>
<td class="org-right">0.06</td>
<td class="org-right">0.65</td>
</tr>

<tr>
<td class="org-left">full tr</td>
<td class="org-right">100000</td>
<td class="org-right">14</td>
<td class="org-right">11.9</td>
<td class="org-right">0.62</td>
<td class="org-right">0.02</td>
<td class="org-right">0.65</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">no tr</td>
<td class="org-right">200000</td>
<td class="org-right">14</td>
<td class="org-right">23.4</td>
<td class="org-right">1.27</td>
<td class="org-right">0.12</td>
<td class="org-right">1.41</td>
</tr>

<tr>
<td class="org-left">mapt only</td>
<td class="org-right">200000</td>
<td class="org-right">14</td>
<td class="org-right">23.4</td>
<td class="org-right">1.32</td>
<td class="org-right">0.06</td>
<td class="org-right">1.40</td>
</tr>

<tr>
<td class="org-left">full tr</td>
<td class="org-right">200000</td>
<td class="org-right">14</td>
<td class="org-right">23.4</td>
<td class="org-right">1.30</td>
<td class="org-right">0.08</td>
<td class="org-right">1.39</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">no tr</td>
<td class="org-right">300000</td>
<td class="org-right">14</td>
<td class="org-right">35.1</td>
<td class="org-right">2.01</td>
<td class="org-right">0.11</td>
<td class="org-right">2.13</td>
</tr>

<tr>
<td class="org-left">mapt only</td>
<td class="org-right">300000</td>
<td class="org-right">14</td>
<td class="org-right">35.1</td>
<td class="org-right">1.92</td>
<td class="org-right">0.17</td>
<td class="org-right">2.10</td>
</tr>

<tr>
<td class="org-left">full tr</td>
<td class="org-right">300000</td>
<td class="org-right">14</td>
<td class="org-right">35.1</td>
<td class="org-right">1.97</td>
<td class="org-right">0.12</td>
<td class="org-right">2.11</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">no tr</td>
<td class="org-right">500000</td>
<td class="org-right">14</td>
<td class="org-right">59.5</td>
<td class="org-right">CRASH</td>
<td class="org-right">CRASH</td>
<td class="org-right">CRASH</td>
</tr>

<tr>
<td class="org-left">mapt only</td>
<td class="org-right">500000</td>
<td class="org-right">14</td>
<td class="org-right">59.5</td>
<td class="org-right">3.15</td>
<td class="org-right">0.15</td>
<td class="org-right">3.32</td>
</tr>

<tr>
<td class="org-left">full tr</td>
<td class="org-right">500000</td>
<td class="org-right">14</td>
<td class="org-right">59.5</td>
<td class="org-right">3.13</td>
<td class="org-right">0.17</td>
<td class="org-right">3.32</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">no tr</td>
<td class="org-right">1000000</td>
<td class="org-right">14</td>
<td class="org-right">119.0</td>
<td class="org-right">CRASH</td>
<td class="org-right">CRASH</td>
<td class="org-right">CRASH</td>
</tr>

<tr>
<td class="org-left">mapt only</td>
<td class="org-right">1000000</td>
<td class="org-right">14</td>
<td class="org-right">119.0</td>
<td class="org-right">6.47</td>
<td class="org-right">0.35</td>
<td class="org-right">6.86</td>
</tr>

<tr>
<td class="org-left">full tr</td>
<td class="org-right">1000000</td>
<td class="org-right">14</td>
<td class="org-right">119.0</td>
<td class="org-right">6.55</td>
<td class="org-right">0.34</td>
<td class="org-right">6.92</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">no tr</td>
<td class="org-right">5000000</td>
<td class="org-right">14</td>
<td class="org-right">595.1</td>
<td class="org-right">CRASH</td>
<td class="org-right">CRASH</td>
<td class="org-right">CRASH</td>
</tr>

<tr>
<td class="org-left">mapt only</td>
<td class="org-right">5000000</td>
<td class="org-right">14</td>
<td class="org-right">595.1</td>
<td class="org-right">31.27</td>
<td class="org-right">1.90</td>
<td class="org-right">33.28</td>
</tr>

<tr>
<td class="org-left">full tr</td>
<td class="org-right">5000000</td>
<td class="org-right">14</td>
<td class="org-right">595.1</td>
<td class="org-right">31.59</td>
<td class="org-right">1.76</td>
<td class="org-right">33.46</td>
</tr>
</tbody>
</table>

<p>
One might assume the tail-recursive CSV Cleaner variants (&ldquo;mapt only&rdquo;, &ldquo;full tr&rdquo;) were a bit faster than the one implementation &ldquo;no tr&rdquo; without tail recursion. When we compare both tail-recursive variants with each other, they seem to come pretty close, while the &ldquo;full tr&rdquo; seems a little behind.<br>
</p>

<p>
But in fact I think those differences are insignificant, because the variants are often only hundereds of milliseconds apart, and the results sometimes overlap. I guess that things like file system cache, processor cache, other background processes etc. matter much more.<br>
</p>
</div>
</div>
<div id="outline-container-orgdb73047" class="outline-2">
<h2 id="orgdb73047"><a href="#orgdb73047">Conclusion</a></h2>
<div class="outline-text-2" id="text-orgdb73047">
<p>
It makes sense to write functions in the tail-recursive style, since it eliminates the chance to run into a &ldquo;low-hanging&rdquo; ressource limit unneccessarily. But the next limit lurks just around the corner: the amount of total memory available. I did some runs on CSV files with 300000 rows but this time 400 columns instead of 14, and the process quickly ate up 16 GB RAM + 4 GB swap space and got killed by the OS eventually.<br>
</p>

<p>
Anyway, I had fun to gnaw on those larger files. Probably I should have used a data structure other than linked lists in the first place; and I&rsquo;m quite optimistic the whole task could be done more efficiently.<br>
</p>
</div>
</div>
