blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org
* Full Code Listing, Version 0.3

#+caption: Fully tail-recursive
#+begin_src ocaml
  (* Version 0.3 *)

  (** Tail-recursive alternative to [List.map] *)
  let mapt f l =
    List.rev (List.rev_map f l)

  (** Transforms the file into a key-value data structure *)
  let prep file =
    let tab_file = open_in file in
    tab_file
    |> Csv.of_channel
    |> Csv.input_all
    |> fun tab -> let head, body =
                    match tab with
                    | [] -> assert false
                    | hd :: tl -> hd, tl in
    let () = close_in tab_file in
    Csv.associate head body

  (** Drops the columns that are not specified by the template *)
  let clean tab =
    let tpl_file = open_in "template.csv" in
    let tpl = tpl_file
              |> Csv.of_channel ~has_header:true
              |> Csv.Rows.header in
    let () = close_in tpl_file in
    let remove_cols tpl row =
      let rec aux accu tpl row =
        match row with
        | [] -> List.rev accu
        | (k, v) :: tl when List.mem k tpl -> aux ((k, v) :: accu) tpl tl
        | _ :: tl -> aux accu tpl tl in
      aux [] tpl row in
    mapt (remove_cols tpl) tab

  (** Transforms the key-value data structure into lists representing lines *)
  let dissoc =
    let get_keys row =
      let rec aux accu =
        function
        | [] -> accu
        | (k, _) :: tl -> aux (k :: accu) tl in
      List.rev (aux [] row) in
    let get_values row =
      let rec aux accu =
        function
        | [] -> accu
        | (_, v) :: tl -> aux (v :: accu) tl in
      List.rev (aux [] row) in
    function
    | [] -> []
    | hd :: tl -> get_keys hd :: mapt get_values (hd :: tl)

  (** Writes the cleaned CSV file to disk *)
  let save tab =
    Csv.save ~separator:'|' ~quote_all:true tab

  (** Puts all together in one pipe *)
  let () = "input.csv"
           |> prep
           |> clean
           |> dissoc
           |> save "output.csv"
#+end_src

* What's next?
Right now I wonder how it would turn out to run the CSV Cleaner on multiple cores. But likely I'm going to implement one or two of the pending features in the next episode.

- [X] Open and read a CSV file "input.csv"
- [X] Remove some columns according to a "template.csv"
- [ ] Perform search and replace on cell content
- [X] Set the pipe '|' as the delimiter char
- [X] Spit out a sweet cleaned CSV file "output.csv"
- [X] Compile to a standalone binary
- [X] Make it work with bigger CSV files
- [ ] File selection via command line arguments
- [ ] Combine content of certain rows into one

Hope you enjoyed the walktrough. Suggestions are always welcome!
