blog/first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html
<div id="outline-container-orgbe706f5" class="outline-2">
<h2 id="orgbe706f5"><a href="#orgbe706f5">Full Code Listing, Version 0.3</a></h2>
<div class="outline-text-2" id="text-orgbe706f5">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 28: </span>Fully tail-recursive</label><pre class="src src-ocaml"><span class="org-comment-delimiter">(* </span><span class="org-comment">Version 0.3</span><span class="org-comment-delimiter"> *)</span>

<span class="org-doc">(** Tail-recursive alternative to </span><span class="org-tuareg-font-lock-doc-markup">[</span><span class="org-tuareg-font-lock-module">List.</span>map<span class="org-tuareg-font-lock-doc-markup">]</span><span class="org-doc"> *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">mapt</span> <span class="org-variable-name">f</span> <span class="org-variable-name">l</span> =
  <span class="org-tuareg-font-lock-module">List.</span>rev <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-tuareg-font-lock-module">List.</span>rev_map f l<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-doc">(** Transforms the file into a key-value data structure *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">prep</span> <span class="org-variable-name">file</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tab_file</span> = open_in file <span class="org-tuareg-font-lock-governing">in</span>
  tab_file
  <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.</span>of_channel
  <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.</span>input_all
  <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-keyword">fun</span> <span class="org-variable-name">tab</span> -&gt; <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">head</span>, <span class="org-variable-name">body</span> =
                  <span class="org-keyword">match</span> tab <span class="org-keyword">with</span>
                  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-keyword">assert</span> <span class="org-constant">false</span>
                  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; hd, tl <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-rainbow-delimiters-depth-1">()</span> = close_in tab_file <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-module">Csv.</span>associate head body

<span class="org-doc">(** Drops the columns that are not specified by the template *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">clean</span> <span class="org-variable-name">tab</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tpl_file</span> = open_in <span class="org-string">"template.csv"</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">tpl</span> = tpl_file
            <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.</span>of_channel <span class="org-tuareg-font-lock-label">~has_header</span>:<span class="org-constant">true</span>
            <span class="org-tuareg-font-lock-operator">|&gt;</span> <span class="org-tuareg-font-lock-module">Csv.Rows.</span>header <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-rainbow-delimiters-depth-1">()</span> = close_in tpl_file <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">remove_cols</span> <span class="org-variable-name">tpl</span> <span class="org-variable-name">row</span> =
    <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">aux</span> <span class="org-variable-name">accu</span> <span class="org-variable-name">tpl</span> <span class="org-variable-name">row</span> =
      <span class="org-keyword">match</span> row <span class="org-keyword">with</span>
      | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-module">List.</span>rev accu
      | <span class="org-rainbow-delimiters-depth-1">(</span>k, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl <span class="org-keyword">when</span> <span class="org-tuareg-font-lock-module">List.</span>mem k tpl -&gt; aux <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>k, v<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-tuareg-font-lock-constructor">::</span> accu<span class="org-rainbow-delimiters-depth-1">)</span> tpl tl
      | _ <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; aux accu tpl tl <span class="org-tuareg-font-lock-governing">in</span>
    aux <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> tpl row <span class="org-tuareg-font-lock-governing">in</span>
  mapt <span class="org-rainbow-delimiters-depth-1">(</span>remove_cols tpl<span class="org-rainbow-delimiters-depth-1">)</span> tab

<span class="org-doc">(** Transforms the key-value data structure into lists representing lines *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">dissoc</span> =
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">get_keys</span> <span class="org-variable-name">row</span> =
    <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">aux</span> <span class="org-variable-name">accu</span> =
      <span class="org-keyword">function</span>
      | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; accu
      | <span class="org-rainbow-delimiters-depth-1">(</span>k, _<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; aux <span class="org-rainbow-delimiters-depth-1">(</span>k <span class="org-tuareg-font-lock-constructor">::</span> accu<span class="org-rainbow-delimiters-depth-1">)</span> tl <span class="org-tuareg-font-lock-governing">in</span>
    <span class="org-tuareg-font-lock-module">List.</span>rev <span class="org-rainbow-delimiters-depth-1">(</span>aux <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-2">[]</span></span> row<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">get_values</span> <span class="org-variable-name">row</span> =
    <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">aux</span> <span class="org-variable-name">accu</span> =
      <span class="org-keyword">function</span>
      | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; accu
      | <span class="org-rainbow-delimiters-depth-1">(</span>_, v<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; aux <span class="org-rainbow-delimiters-depth-1">(</span>v <span class="org-tuareg-font-lock-constructor">::</span> accu<span class="org-rainbow-delimiters-depth-1">)</span> tl <span class="org-tuareg-font-lock-governing">in</span>
    <span class="org-tuareg-font-lock-module">List.</span>rev <span class="org-rainbow-delimiters-depth-1">(</span>aux <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-2">[]</span></span> row<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-tuareg-font-lock-governing">in</span>
  <span class="org-keyword">function</span>
  | <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span> -&gt; <span class="org-tuareg-font-lock-constructor"><span class="org-rainbow-delimiters-depth-1">[]</span></span>
  | hd <span class="org-tuareg-font-lock-constructor">::</span> tl -&gt; get_keys hd <span class="org-tuareg-font-lock-constructor">::</span> mapt get_values <span class="org-rainbow-delimiters-depth-1">(</span>hd <span class="org-tuareg-font-lock-constructor">::</span> tl<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-doc">(** Writes the cleaned CSV file to disk *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">save</span> <span class="org-variable-name">tab</span> =
  <span class="org-tuareg-font-lock-module">Csv.</span>save <span class="org-tuareg-font-lock-label">~separator</span>:<span class="org-string">'|'</span> <span class="org-tuareg-font-lock-label">~quote_all</span>:<span class="org-constant">true</span> tab

<span class="org-doc">(** Puts all together in one pipe *)</span>
<span class="org-tuareg-font-lock-governing">let</span> <span class="org-rainbow-delimiters-depth-1">()</span> = <span class="org-string">"input.csv"</span>
         <span class="org-tuareg-font-lock-operator">|&gt;</span> prep
         <span class="org-tuareg-font-lock-operator">|&gt;</span> clean
         <span class="org-tuareg-font-lock-operator">|&gt;</span> dissoc
         <span class="org-tuareg-font-lock-operator">|&gt;</span> save <span class="org-string">"output.csv"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd8ab0e4" class="outline-2">
<h2 id="orgd8ab0e4"><a href="#orgd8ab0e4">What&rsquo;s next?</a></h2>
<div class="outline-text-2" id="text-orgd8ab0e4">
<p>
Right now I wonder how it would turn out to run the CSV Cleaner on multiple cores. But likely I&rsquo;m going to implement one or two of the pending features in the next episode.<br>
</p>

<ul class="org-ul">
<li class="on">&#x2611; Open and read a CSV file &ldquo;input.csv&rdquo;<br></li>
<li class="on">&#x2611; Remove some columns according to a &ldquo;template.csv&rdquo;<br></li>
<li class="off">&#x2610; Perform search and replace on cell content<br></li>
<li class="on">&#x2611; Set the pipe &rsquo;|&rsquo; as the delimiter char<br></li>
<li class="on">&#x2611; Spit out a sweet cleaned CSV file &ldquo;output.csv&rdquo;<br></li>
<li class="on">&#x2611; Compile to a standalone binary<br></li>
<li class="on">&#x2611; Make it work with bigger CSV files<br></li>
<li class="off">&#x2610; File selection via command line arguments<br></li>
<li class="off">&#x2610; Combine content of certain rows into one<br></li>
</ul>

<p>
Hope you enjoyed the walktrough. Suggestions are always welcome!<br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/about.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
